Repository: Tcod/libvirt-sandbox
Catalog: po/*.po
Languages: fr

source: display version information
fr: afficher les information de version

source: display verbose information
fr: afficher les informations verbeuses

source: display debugging information
fr: afficher les informations de débogage

source: connect to hypervisor
fr: se connecter à l'hyperviseur

source: name of the sandbox
fr: nom du bac à sable

source: mount a filesystem in the guest
fr: monter un système de fichier a l'invité

source: file to copy into custom dir
fr: fichier pour copier dans un répertoire personnalisé

source: file contain list of files to include
fr: fichier qui contient une liste de fichiers pour inclure

source: setup network interface properties
fr: configurer les propriétés d'interface du réseau

source: security properties
fr: propriétés de sécurité

source: run the command privileged
fr: lancer la commande des privilèges

source: start a shell
fr: démarrer un interpréteur de commandes

source: Run 'virt-sandbox --help' to see a full list of available command line options
fr: Exécuter « virt-sandbox --help » pour voir la liste complète des options de commande disponibles en ligne

source: Usage: %s [OPTIONS] COMMAND-PATH [ARGS...] %s
fr: Utilisation : %s [OPTIONS] COMMAND-PATH [ARGS...] %s

source: Unable to open connection: %s
fr: Impossible d'ouvrir la connexion : %s

source: Unknown failure
fr: Échec inconnu

source: Unable to parse mounts: %s
fr: Impossible d'analyser les montages : %s

source: Unable to parse includes: %s
fr: Impossible d'analyser les inclusions : %s

source: Unable to parse include file: %s
fr: Impossible d'analyser le fichier inclus : %s

source: Unable to parse networks: %s
fr: Impossible d'analyser les réseaux : %s

source: Unable to parse security: %s
fr: Impossible d'analyser la sécurité : %s

source: Unable to start sandbox: %s
fr: Impossible de démarrer le sandbox : %s

source: Unable to get log console: %s
fr: Impossible d'obtenir la console de journalisation : %s

source: Unable to attach sandbox console: %s
fr: Impossible de s'attacher à la console du sandbox : %s

source: Unable to get app console: %s
fr: Impossible d'obtenir la console d''application : %s

source: unknown
fr: inconnu

source: Unable to read config file %s: %s
fr: Impossible de lire le fichier de configuration %s : %s

source: Unable to create new context service: %s
fr: Impossible de créer un nouveau contexte de service : %s

source: Unable to start container: %s
fr: Impossible d'initier le conteneur : %s

source: Unable to get log console for container: %s
fr: Impossible d'obtenir la console de connexion du conteneur : %s

source: Unable to attach console to stderr in the container: %s
fr: Impossible d'attacher la console à l'erreur standard du bac à sable : %s

source: Unable to attach to container: %s
fr: Impossible de s'attacher au conteneur : %s

source: Unable to get shell console for container: %s
fr: Impossible d'obtenir la console de l'interpréteur de commande du conteneur : %s

source: Display version information
fr: Afficher les informations de version

source: Start a container
fr: Démarrer un conteneur

source: Attach to a container
fr: S'attacher au conteneur

source: Pid of process in container to which the command will run
fr: PID du processus du conteneur dans lequel la commande sera exécutée

source: Connect to hypervisor Default:'lxc:///'
fr: Se connecter à l'hyperviseur. Par défaut : « lxc:/// »

source: Run 'virt-sandbox-service-util --help' to see a full list of available command line options
fr: Exécuter « virt-sandbox-service --help » afin de voir la liste complète d' options de commandes disponibles en ligne

source: - Libvirt Sandbox Service
fr: - Service de bac à sable libvirt

source: Invalid command CONTAINER_NAME required: %s
fr: Commande invalide, nom du conteneur indispensable : %s

source: Libvirt Sandbox Service
fr: Service de bac à sable libvirt

source: Unable to create temporary directory %s: %s
fr: Impossible de créer un répertoire temporaire %s : %s

source: Unable to read entries in %s: %s
fr: Impossible de lire les entrées dans %s : %s

source: Unable to access %s: %s
fr: Impossible d'accéder %s : %s

source: Cannot request DHCP with static routes/addresses
fr: Impossible d'effectuer une requête DHCP avec des routes ou adresses statiques

source: Cannot set static addresses with DHCP
fr: Impossible de définir des adresses statiques avec DHCP

source: Unable to parse address %s
fr: Impossible d'analyser l'adresse %s

source: Cannot set static routes with DHCP
fr: Impossible de définir des routes statiques avec DHCP

source: Unknown parameter %s
fr: Paramètre inconnu %s

source: Cannot set static routes without addresses
fr: Impossible de définir des routes statiques sans adresse

source: No mount type prefix on %s
fr: Aucun préfixe de montage pour %s

source: Unknown mount type prefix on %s
fr: Préfixe de type de montage inconnu pour %s

source: No mount with a prefix under %s
fr: Pas de montage avec prefixe sous %s

source: Unknown security option '%s'
fr: Option de sécurité inconnue « %s »

source: Missing mount target in config file
fr: Cible de montage manquant dans le fichier de configuration

source: Missing mount type in config file
fr: Type de montage manquant dans le fichier de configuration

source: Unknown mount type %s in config file
fr: Type de montage %s inconnu dans le fichier de configuration

source: Missing mount usage in config file
fr: Utilisation de montage manquant dans le fichier de configuration

source: Missing mount source in config file
fr: Source de montage manquant dans le fichier de configuration

source: Missing class name in config file
fr: Nom de classe manquant dans le fichier de configuration

source: Unknown type name '%s' in config file
fr: Nom de type « %s » inconnu dans le fichier de configuration

source: Type name '%s' in config file had wrong parent
fr: Le nom de type « %s » dans le fichier de configuration n'a pas le bon parent

source: Unable to query terminal attributes: %s
fr: Impossible de demander les attributs du terminal : %s

source: Unable to update terminal attributes: %s
fr: Impossible d'actualiser les attributs du terminal : %s

source: Unable to restore terminal attributes: %s
fr: Impossible de restaurer les attributs du terminal : %s

source: Console is already attached to a stream
fr: La console est déjà attachée à un flux

source: Unexpected rpc status %u
fr: État RPC inattendu %u

source: Unexpected rpc proc %u
fr: Proc RPC innatendu %u

source: Got rx in unexpected state %d
fr: rx obtenu en un état inattendu %d

source: ConsoleRpc is not attached to a stream
fr: ConsoleRpc n'est pas attaché à un flux

source: Domain is not currently running
fr: Le domaine n'est pas actuellement actif

source: libvirt-sandbox-init-common: unable to create signal pipe: %s
fr: libvirt-sandbox-init-common : impossible de créer le type de signalisation : %s

source: libvirt-sandbox-init-common: cannot open %s: %s
fr: libvirt-sandbox-init-common : impossible d'ouvrir %s : %s

source: libvirt-sandbox-init-common: %s: cannot execute %s: %s
fr: libvirt-sandbox-init-common : %s: impossible d'exécuter %s : %s

source: config file path
fr: chemin du fichier de configuration

source: Run '
fr: Exécuter '

source: %s: must be launched as root
fr: %s : doit être exécuté en tant que root

source: Libvirt Sandbox Init Common
fr: Libvirt Sandbox Init Commun

source: %s: Unable to load config %s: %s
fr: %s : Impossible de charger la configuration %s : %s

source: Unsupported configuration type %s
fr: Type de configuration %s non pris en charge

source: Unable to decode message length
fr: Impossible de décoder la longueur du message

source: packet %u bytes received from server too small, want %u
fr: le paquet de %u octets reçu du serveur est trop petit, %u attendus

source: packet %u bytes received from server too large, want %d
fr: le paquet de %u octets reçu du serveur est trop grand, %d attendus

source: Unable to decode message header
fr: Impossible de décoder l'entête du message

source: Unable to encode message length
fr: Impossible d'encoder la longueur du message

source: Unable to encode message header
fr: Impossible d'encoder l'entête du message

source: Unable to re-encode message length
fr: Impossible de réencoder la longueur du message

source: Unable to encode message payload
fr: Impossible d'encoder le contenu du message

source: Unable to decode message payload
fr: Impossible de décoder le contenu du message

source: Raw data too long to send (%zu bytes needed, %zu bytes available)
fr: Données brutes trop longues à envoyer (%zu octets nécessaires, %zu octets disponibles)
